In [1]:
#readers and writers 
"""
readers:         writers:
pd.read_csv() -  pd.to_csv()
pd.read_excel() - pd.to_excel()
pd.read_hrf() - pd.to_hrf()
pd.read_sql() - pd.to_sql()
pd.read_json() - pd.to_json()
pd.read_html() - pd.to_html()
pd.read_stata() - pd.to_stata()
pd.read_clipboard() - pd.to_clipboard()
pd.read_pickle() - pd.to_pickle()
pd.read_msgpack() - pd.to_msgpack()
pd.read_gbp() - pd.to_gbp
"""

'\nreaders:         writers:\npd.read_csv() -  pd.to_csv()\npd.read_excel() - pd.to_excel()\npd.read_hrf() - pd.to_hrf()\npd.read_sql() - pd.to_sql()\npd.read_json() - pd.to_json()\npd.read_html() - pd.to_html()\npd.read_stata() - pd.to_stata()\npd.read_clipboard() - pd.to_clipboard()\npd.read_pickle() - pd.to_pickle()\npd.read_msgpack() - pd.to_msgpack()\npd.read_gbp() - pd.to_gbp\n'

In [12]:
import pandas as pd
import numpy as np

In [14]:
csvframe = pd.read_csv('ch05_01.csv.txt.txt')
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1   mouse

In [15]:
# también se puede usar el read_table usando el "," como separador
csvframe = pd.read_table('ch05_01.csv.txt.txt', sep=",")
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1   mouse

In [17]:
csvframe = pd.read_csv('ch05_02.csv.txt.txt') #csv sin header, se toma la primera línea como si fueran las col
csvframe

   1  5  2  3    cat
0  2  7  8  5    dog
1  3  3  6  7  horse
2  2  2  8  3   duck
3  4  4  2  1   mouse

In [18]:
csvframe = pd.read_csv('ch05_02.csv.txt.txt', header=None) #csv sin header, header=None coloca numeros como columnas
csvframe

   0  1  2  3       4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1   mouse

In [20]:
csvframe = pd.read_csv('ch05_02.csv.txt.txt',names=['white','red','blue','green','animal'])
csvframe

   white  red  blue  green  animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1   mouse

In [24]:
csvframe = pd.read_csv('ch05_03.csv.txt', index_col = ["color", "status" ]) #asignar valores de índice 
csvframe

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

In [28]:
# using regex to parse txt use sep= '\s+' usa el tab y el separador 
csvframe = pd.read_table('ch05_04.txt.txt',sep='\s+', engine='python')
csvframe

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

In [37]:
# is possible to use char separators 
csvframe = pd.read_table('ch05_05.txt.txt',sep='\D+', header= None, engine = 'python')
csvframe

   0    1    2
0  0  123  122
1  1  124  321
2  2  125  333

In [43]:
csvframe = pd.read_table('ch05_06.txt.txt',sep=',',skiprows=[1,4])
csvframe

   white  red  blue  green animal
0      1    5     2      3   cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [45]:
csvframe = pd.read_table('ch05_06.txt.txt',sep=',',skiprows=[2], nrows=3, header=None) #nrows chunk reading of the file
csvframe

                                                  0    1     2      3       4
0                                             white  red  blue  green  animal
1  12-Feb-2015:Counting of animals inside the house  NaN   NaN    NaN     NaN
2                                                 2    7     8      5     dog

In [46]:
# WRITING DATA IN CSV
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['red', 'blue', 'yellow', 'white'], columns = ['ball', 'pen', 'pencil', 'paper'])
frame.to_csv('ch05_07.csv')

In [48]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['red', 'blue', 'yellow', 'white'], columns = ['ball', 'pen', 'pencil', 'paper'])
frame.to_csv('ch05_08.csv', index=False, header= False)

In [49]:
frame3 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],[np.nan,np.nan,np.nan,np.nan,np.nan],[np.nan,np.nan,np.nan,np.nan,np.nan],[20,np.nan,np.nan,20.0,np.nan],[19,np.nan,np.nan,19.0,np.nan]],index=['blue','green','red','white','yellow'], columns=['ball','mug','paper','pen','pencil'])
frame3

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [53]:
frame3.to_csv('ch05_10.csv')# los NaN aparecen como vacíos, si se pasa na_rep = NaN se reemplaza el vacío con NaN o lo que sea

In [54]:
frame3.to_csv('ch05_11.csv', na_rep=0)#acá se llenan los espacios vacíos con 0

In [59]:
# reading and writing html- web scraping - data mining and data preparatio
frame = pd.DataFrame(np.arange(4).reshape(2,2))
frame

   0  1
0  0  1
1  2  3

In [60]:
frame.to_html()

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>0</th>\n      <th>1</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>0</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>2</td>\n      <td>3</td>\n    </tr>\n  </tbody>\n</table>'

In [68]:
frame = pd.DataFrame( np.random.random((4,4)),index = ['white','black','red','blue'],columns = ['up','down','right','left'])
s = ['<HTML>']
s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame.to_html()) # convertir el frame en el body en formate html
s.append('</BODY></HTML>')
html = str(s) #var html es un string
html_file = open('myFrame.html','w') #crea el archivo que va a recibir el html
html_file.write(html) # escribre sobre el archivo
html_file.close() # cierra el archivo creado que pasa al escritorio

In [71]:
#reading html files
web_frames = pd.read_html('myFrame.html')
web_frames

[  Unnamed: 0        up      down     right      left
 0      white  0.050216  0.577108  0.264864  0.605119
 1      black  0.418250  0.111400  0.903377  0.164718
 2        red  0.155321  0.487137  0.026132  0.916362
 3       blue  0.301297  0.232480  0.934215  0.295653]

In [78]:
web_frames = pd.read_html('myFrame.html')
web_frames[0]

  Unnamed: 0        up      down     right      left
0      white  0.050216  0.577108  0.264864  0.605119
1      black  0.418250  0.111400  0.903377  0.164718
2        red  0.155321  0.487137  0.026132  0.916362
3       blue  0.301297  0.232480  0.934215  0.295653

In [79]:
ranking = pd.read_html('https://www.meccanismocomplesso.org/en/meccanismo-complesso-sito-2/classifica-punteggio/')
ranking[0]

     Unnamed: 0        Member  Points  Levels
0             1   BrunoOrsini    2075     NaN
1             2     Berserker     700     NaN
2             3  albertosallu     275     NaN
3             4           Jon     180     NaN
4             5          Mr.Y     180     NaN
..          ...           ...     ...     ...
110         111  Gigi Bertana       5     NaN
111         112       p.barut       5     NaN
112         113  Indri4Africa       5     NaN
113         114     ghirograf       5     NaN
114         115  Marco Corbet       5     NaN

[115 rows x 4 columns]

In [84]:
from lxml import objectify # another library used to handle large html files

In [89]:
xml = objectify.parse('books.xlm')
xml

In [91]:
# to navigate in the tree structure use the getroot() 
root = xml.getroot() # permite acceder a distintos nodos del árbol
root

In [92]:
root.Book.Author

'Ross, Mark'

In [93]:
root.Book.PublishDate

'2014-22-01'

In [98]:
# getchildren() - permite tomar todos los nodos de una rama dada
[children for children in root.Book.getchildren()]

['Ross, Mark', 'XML Cookbook', 'Computer', 23.56, '2014-22-01']

In [99]:
[children.tag for children in root.Book.getchildren()] #tag agrega el título del elemento

['Author', 'Title', 'Genre', 'Price', 'PublishDate']

In [123]:
#convertir el tree en un dataframe
def etree2df(root):
    column_names = []
    for i in range(0,len(root.getchildren()[0].getchildren())):
        column_names.append(root.getchildren()[0].getchildren()[i].tag)
    frame = pd.DataFrame(columns = column_names)
    
    for j in range(0, len(root.getchildren())):
        obj = root.getchildren()[j].getchildren() # todos los elementos en la posicion j  de getchildren
        texts= []
        for k in range(0, len(column_names)):
            texts.append(obj[k].text) #agrega a texts cada valor k presente en obj
        row = dict(zip(column_names, texts)) # crea un dicionario con los valores con las columnas
        row_s = pd.Series(row)
        row_s.name = j # numeros de rows, sirve de índice para el pd.Series
        frame = frame.append(row_s) # agrega la serie al data frame
    return frame

In [124]:
etree2df(root)

             Author            Title     Genre  Price PublishDate
0        Ross, Mark     XML Cookbook  Computer  23.56  2014-22-01
1  Bracket, Barbara  XML for Dummies  Computer  35.95  2014-12-16

In [117]:
root.getchildren()[0].getchildren() # devuelve los valores que se encuentran en la posición 0 del root

['Ross, Mark', 'XML Cookbook', 'Computer', 23.56, '2014-22-01']

In [118]:
root.getchildren()[1].getchildren()

['Bracket, Barbara', 'XML for Dummies', 'Computer', 35.95, '2014-12-16']

In [119]:
len(root.getchildren()) # cantidad de ramas que vienen de root.

2

In [120]:
len(root.getchildren()[1].getchildren()) # número de elementos children de este nodo

5

In [134]:
root.getchildren()[0].getchildren()[0].tag # el segundo parentesis indica el nombre de la columna (por poner el tag)

'Author'

In [140]:
frame = pd.DataFrame(np.random.random((4,4)),index = ['exp1','exp2','exp3','exp4'], columns = ['Jan2015','Fab2015','Mar2015','Apr2005'])
pd.to_excel('data.xlsx')

AttributeError: module 'pandas' has no attribute 'to_excel'

In [136]:
# json data: java script object notation

In [137]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),index=['white','black','red','blue'],columns=['up','down','right','left'])
frame.to_json('frame.json')

In [139]:
pd.read_json('frame.json')

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [148]:
#usualy json files do not have a tabular form so is necesary to normalize- to convert the dict structure into tabular
from pandas.io.json import json_normalize
import json
file = open('books1.json', 'r')
text = file.read()
text = json.loads(text)
text

[{'writer': 'Mark Ross',
  'nationality': 'USA',
  'books': [{'title': 'XML Cookbook', 'price': 23.56},
   {'title': 'Python Fundamentals', 'price': 50.7},
   {'title': 'The NumPy library', 'price': 12.3}]},
 {'writer': 'Barbara Bracket',
  'nationality': 'UK',
  'books': [{'title': 'Java Enterprise', 'price': 28.6},
   {'title': 'HTML5', 'price': 31.35},
   {'title': 'Python for Dummies', 'price': 28.0}]}]

In [158]:
json_normalize(text,'books') # va a leer y pasar a todos los elementos que tengan el key books

<ipython-input-158-d57c3786a6ea>:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  json_normalize(text,'books', 'writer')

                 title  price           writer
0         XML Cookbook  23.56        Mark Ross
1  Python Fundamentals  50.70        Mark Ross
2    The NumPy library  12.30        Mark Ross
3      Java Enterprise  28.60  Barbara Bracket
4                HTML5  31.35  Barbara Bracket
5   Python for Dummies  28.00  Barbara Bracket

In [159]:
json_normalize(text,'books',['writer', 'nationality']) # devuelve todos los que están debajo del key books y le suma de writer y nat

<ipython-input-159-5cf25c6ae6c9>:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  json_normalize(text,'books',['writer', 'nationality'])

                 title  price           writer nationality
0         XML Cookbook  23.56        Mark Ross         USA
1  Python Fundamentals  50.70        Mark Ross         USA
2    The NumPy library  12.30        Mark Ross         USA
3      Java Enterprise  28.60  Barbara Bracket          UK
4                HTML5  31.35  Barbara Bracket          UK
5   Python for Dummies  28.00  Barbara Bracket          UK

In [166]:
# HDF5 library - hierarquical data format
from pandas.io.pytables import HDFStore
frame = pd.DataFrame(np.arange(16).reshape(4,4), index=['white','black','red','blue'], columns=['up','down','right','left'])
store = HDFStore('my_data.h5')
store['obj1'] = frame
type(frame)

pandas.core.frame.DataFrame

In [168]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: my_data.h5

In [169]:
#Pickle > hierarchy of an object is converted  into a stream of bytes- memory eff.
import pickle

In [170]:
data = {'color': ['white','red'], 'value': [5, 7]}
pickled_data = pickle.dumps(data)
print(pickled_data)

b'\x80\x04\x95/\x00\x00\x00\x00\x00\x00\x00}\x94(\x8c\x05color\x94]\x94(\x8c\x05white\x94\x8c\x03red\x94e\x8c\x05value\x94]\x94(K\x05K\x07eu.'

In [171]:
type(pickled_data)

bytes

In [172]:
nframe = pickle.loads(pickled_data)
nframe

{'color': ['white', 'red'], 'value': [5, 7]}

In [174]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), index = ['up','down','left','right'])
frame.to_pickle('frame.pkl')

In [176]:
d = pd.read_pickle('frame.pkl')
d

        0   1   2   3
up      0   1   2   3
down    4   5   6   7
left    8   9  10  11
right  12  13  14  15

In [177]:
# importing using SQL
from sqlalchemy import create_engine

In [186]:
frame = pd.DataFrame( np.arange(20).reshape(4,5),columns=['white','red','blue','black','green'])
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19